---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotConvertSketch
source: html/3f09c2c2-b9b1-052c-c058-81f569eb5966.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotConvertSketch Property

Can't convert Sketch to Rebar Shape.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotConvertSketch { get; }
```